In [1]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in /Users/justbeaver/Library/Python/3.8/lib/python/site-packages (1.2.4)
Requirement already satisfied: numpy>=1.16.5 in /Users/justbeaver/Library/Python/3.8/lib/python/site-packages (from pandas) (1.20.1)
Requirement already satisfied: python-dateutil>=2.7.3 in /Users/justbeaver/Library/Python/3.8/lib/python/site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in /Users/justbeaver/Library/Python/3.8/lib/python/site-packages (from pandas) (2021.1)
Requirement already satisfied: six>=1.5 in /Library/Developer/CommandLineTools/Library/Frameworks/Python3.framework/Versions/3.8/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
pip install numpy

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: numpy in /Users/justbeaver/Library/Python/3.8/lib/python/site-packages (1.20.1)
Note: you may need to restart the kernel to use updated packages.

In [3]:
pip install openpyxl

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: openpyxl in /Users/justbeaver/Library/Python/3.8/lib/python/site-packages (3.0.9)
Requirement already satisfied: et-xmlfile in /Users/justbeaver/Library/Python/3.8/lib/python/site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd
import numpy as np

## Groupby
Split -> Apply -> Combine   
Split: Index가 같은 놈들끼리 묶어주기    
Apply: sum, mean, std 같은 함수를 적용시켜 줌   
Combine: Apply된 애들을 합쳐서 하나의 결과로 보여줌

In [5]:
df = pd.read_excel("input_file/titanic.xlsx")
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [6]:
# Embarked: 묶음의 기준
# Fare: sum의 적용 받는 column

df.groupby("Embarked")["Fare"].sum()

Embarked
C    10072.2962
Q     1022.2543
S    17439.3988
Name: Fare, dtype: float64

In [7]:
# hierarchical index - 두 개의 column으로 groupby 

h_index = df.groupby(["Embarked","Sex"])["Fare"].sum()    # excel의 pivot tabel과 동일
h_index

Embarked  Sex
C         female    5487.3958
          male      4584.9004
Q         female     454.8585
          male       567.3958
S         female    7864.4085
          male      9574.9903
Name: Fare, dtype: float64

In [8]:
h_index.index

MultiIndex([('C', 'female'),
            ('C',   'male'),
            ('Q', 'female'),
            ('Q',   'male'),
            ('S', 'female'),
            ('S',   'male')],
           names=['Embarked', 'Sex'])

In [9]:
# hierarchical index 형태를 matrix 형태로 다시 변환

h_index.unstack()

Sex          female       male
Embarked
C         5487.3958  4584.9004
Q          454.8585   567.3958
S         7864.4085  9574.9903

In [10]:
h_index.unstack().stack()

Embarked  Sex
C         female    5487.3958
          male      4584.9004
Q         female     454.8585
          male       567.3958
S         female    7864.4085
          male      9574.9903
dtype: float64

In [11]:
h_index.reset_index()

  Embarked     Sex       Fare
0        C  female  5487.3958
1        C    male  4584.9004
2        Q  female   454.8585
3        Q    male   567.3958
4        S  female  7864.4085
5        S    male  9574.9903

In [12]:
# Embarked와 Sex의 level이 바껴서 나타남

h_index.swaplevel()

Sex     Embarked
female  C           5487.3958
male    C           4584.9004
female  Q            454.8585
male    Q            567.3958
female  S           7864.4085
male    S           9574.9903
Name: Fare, dtype: float64

In [13]:
h_index.sort_index(level=1)

Embarked  Sex
C         female    5487.3958
Q         female     454.8585
S         female    7864.4085
C         male      4584.9004
Q         male       567.3958
S         male      9574.9903
Name: Fare, dtype: float64